# TotalStreams Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSaveToLocalProgressChangedEventArgs..::..TotalStreams Property
DocumentSaveToLocalProgressChangedEventArgs Class See Also
---
The total expected number of streams to save to local.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public int TotalStreams { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TotalStreams As Integer
	Get
```

Visual C++
---
```text
public:
property int TotalStreams {
	int get ();
}
```

# See Also
DocumentSaveToLocalProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace